'''
Данная программа запрашивает у пользователя:
    -имя исследователя(str)
    -название эксперимента(str)
    -количество выполненных запусков(int)
    -длительность одного запуска в секундах(float)
    -действительная часть комплексного коэффициента(float)
    -мнимая часть комплексного коэффициента(float)

Далее вычисляются:
    -общая длительность всех запусков в секундах
    -общая длительность всех запусков в минутах
    -комплексный коэффициент
    -квадрат модуля коэффициента
Проверяется:
    -является ли число запусков ненулевым

Программа выводит:
    -название эксперимента
    -имя исследователя
    -количество запусков
    -общая длительность всех запусков(в секундах и в минутах)
    -комплексный коэффициент
    -квадрат модуля коэффициента
    -есть ли выполненные запуски

Для корректной работы программы требуется вводить данные в соответствии с запрашиваемым типом.
Вводите только целочисленные значения в поле с типом int без указания дробной части. Например:
    Количество выполненных запусков: 5
Вводите целочисленные или вещественные значения в поле с типом float. При необходимости 
используйте в качестве разделителя запятую. Например:
    Длительность одного запуска в секундах: 5.13

Нажатие клавиши Enter завершает ввод значения для одного запроса и активирует ввод для следующего,
если таковой существует. После ввода последнего значения при нажатии клавиши Enter начинаются
вычислительные процессы, на терминал выводится результат.
'''

print('ВВЕДИТЕ СЛЕДУЮЩИЕ ДАННЫЕ')
name = str(input('Имя исследователя: '))
experiment = str(input('Название эксперимента: '))
number = int(input('Количество выполненных запусков: '))
only_duration = float(input('Длительность одного запуска в секундах: '))
complex_re = float(input('Действительная часть комплексного коэфициента: '))
complex_im = float(input('Мнимая часть комплексного коэфициэнта: '))

duration_sec = only_duration * number
duration_min = duration_sec / 60
coefficient = complex(complex_re, complex_im)
abs_coefficient_squared = complex_re ** 2 + complex_im ** 2
has_runs = bool(number)

print('========================================')
print(f'ЭКСПЕРИМЕНТ: {experiment}\nИсследователь: {name}\nЗапуски: {number}\nОбщее время: {duration_sec:.2f} с ({duration_min:.2f} мин)')
print(f'Коэффициент: {coefficient}\nКвадрат модуля: {abs_coefficient_squared:.2f}\nЕсть выполненные запуски: {has_runs}')
print('========================================')

print('input_types:')
print(f'{"name":<20} {type(name)}')
print(f'{"experiment":<20} {type(experiment)}')
print(f'{"number":<20} {type(number)}')
print(f'{"only_duration":<20} {type(only_duration)}')
print(f'{"complex_re":<20} {type(complex_re)}')
print(f'{"complex_im":<20} {type(complex_im)}')