'''Прогноз: 

    первое сравнение - истинно, потому что значения a и b совпадают

    второе сравнение - истинно, потому что переменной b была присвоена ячейка a - это 
    один и тот же объект в памяти компьютера(одинаковый идентификатор)
    
    третье сравнение - истинно, потому что обе переменные содержат числа равной величины,
    хотя заложены в разные ячейки памяти
    
    четвертое сравнение - ложно, потому что оператор "is" сравнивает не значение переменных, 
    а их место в памяти компьютера(разные идентификаторы)'''

a = 2500
b = a
c = int("2500")

print("Типы:", type(a), type(b), type(c))
print("Идентификаторы:", id(a), id(b), id(c))
print("a == b:", a == b)
print("a is b:", a is b)
print("a == c:", a == c)
print("a is c:", a is c)

#2
''' Равенство в языке python не значит идентичность. Оператор "==" сравнивает значения переменных,
    а "is" их место в памяти компьютера. 
    
    В строке 14 переменной a присваивается числовое значение,
    которое фиксируется в памяти компьютера. Созданному объекту присваивается идентификатор.
    Сама переменная обращается к созданной ячейке. В строке 15 переменной b присваивается значение
    a, это значит, что b будет указывать на тот же объект с тем же идентификатором, поэтому оператор
    "is" выводит истину при их сравнении. Переменные указывает на один и тот же объект.
    
    В строке 16 переменной c присваивается числовое значение, но в отличие от объявления переменной b, 
    которая отсылает уже к существующему объекту, для значения переменной c отводится отдельная ячейка 
    в памяти компьютера с новым идентификатором. Поэтому оператор "is" выводит ложь в 23 строке, 
    говоря о том, что переменные указывают на разные объекты с разными идентификаторами, хотя их числовые 
    значения равны.'''

#3
k=None
c = None
print('Yes' if c is None else 'No')
print(id(c), id(k))
#4
first = "python"
second = "py" + "thon"

print(first == second)
print(first is second)
print(id(first))